{
  "ending1": {
    "title": "Разделан",
    "text": "Ты уклоняешься - но слишком медленно. Её когти вспарывают твой живот, кишки вываливаются сквозь разорванную броню.\nТы падаешь на колени, хватаешься за рану, но кровь хлещет между пальцев.\nТварь нависает над тобой, капая слюной.\nПоследнее, что ты видишь - её оскаленную пасть…\nТьма.",
    "achievement": "Смерть в трюме"
  },
  "ending2": {
    "title": "Погребен заживо",
    "text": "Ты не метнулся в панике, твое движение было резким, точным, выверенным годами муштры.\nНо...\nНога. Предательски зацепилась за торчащий арматурный прут. Ты запнулся буквально на миг.\nЭтого хватило.\nГолем ворвался в зону, его чудовищная масса всей тяжестью рухнула на плиту...\nТы увидел падающую тень. Нарастающую. Поглощающую свет. Услышал вой падающего металла. Успеешь? Нет.\nУДАР. Броня трещала. Кости ломались. Мир - карусель боли...\nТьма.",
    "achievement": "Жертва ловушки"
  },
  "ending3": {
    "title": "Слишком громко",
    "text": "Ты ошибся. Роковая ошибка. Может, шаг был слишком громким на зыбкой плите. Может, тень оказалась недостаточно глубокой. Может, просто удача отвернулась. Но страж знал. Он знал, что ты здесь.\nТишину разорвал рык. Не предупреждение. Приговор...\nКлешня рухнула вниз.\nТьма.",
    "achievement": "Обнаружен стражем"
  },
  "ending4": {
    "title": "На что ты надеялся?",
    "text": "Ты увидел его - массивную, искривлённую тень в конце прохода. Чудовище. Порождение Хаоса.\nЛазган вскинут... Вспышка! Луч рвет багровый полумрак. Он бьет точно в грудь монстра.\nУспех? Нет.\nЛуч не прожег, не оплавил - он просто исчез. Будто поглощенный черной дырой...\nКлешня метнулась к тебе - не для захвата. Для удара. Как молот.\nУДАР. Мир погас.",
    "achievement": "Неадекватная оценка угрозы"
  },
  "ending5": {
    "title": "Топливо для кошмара",
    "text": "Отчаянный рывок. Напролом!\nПервый же шаг - провал. Скрипучая решетка ломается. Нога - в пустоте. Падаешь!\nВниз. В кипящую пасть кабельного моря.\nОголенные кабели - змеи. Обвивают ноги. Руки.\nВспышка! Белая. Ослепляющая...\nПоследнее, что видишь - желтое мерцание Хаоса в \"глазах\" кабелей.",
    "achievement": "Жертва энергосистемы"
  },
  "ending6": {
    "title": "Алгоритм безумия",
    "text": "Логика предала. Дезориентация.\nНе тот ритм. Шагнул прямо под слюдяную молнию.\nВСПЫШКА! Миллион вольт! Броня – решетка Фарадея-убийцы. Ток – пожар в нервах. Конвульсии! Падаешь.\nПрямо в кислотную лужу. ШИПЕНИЕ! Дым. Боль вселенская.\nЩупальца – удавки. Обвивают шею. Тянут вглубь. Хруст брони.\nПоследний взгляд – на пульсирующие желтые \"глаза\" в кабелях. Хаос торжествует.\nТьма.",
    "achievement": "Жертва сети"
  },
  "ending7": {
    "title": "Бабочка на булавке",
    "text": "Твой оружие - игрушка в руках непослушного ребенка.\nДрель-молот - над тобой. Ревет.\nУдар! Не просто в грудь. Насквозь.\nХруст.\nТы пригвожден к палубе. Кровь - фонтан из горла.\nЗеркальная маска наклоняется. Видит твой последний вздох.\nДрель - в лицо.\nТьма.\nТвое тело станет новым манипулятором.",
    "achievement": "Смерть от дрели"
  },
  "ending8": {
    "title": "Ты - топливо",
    "text": "Плазменный сгусток.\nПопадание. Броня испаряется вместе с плотью. Твоей плотью.\nТы падаешь. Фильтры плавятся. Глаза выгорают.\nШаги. Тяжелые. Он рядом.\nКлешня-манипулятор хватает то, что осталось от твоего тела. Несет к реактору...\nТвой крик - шипение пара в его системе.",
    "achievement": "Испарен плазмой"
  },
  "ending9": {
    "title": "На службе Хаоса",
    "text": "Волна. Цифровой визг.\nТвой разум - стекло под молотом.\nБоль! Не в теле. В душе. Воспоминания стираются. Воля - песок.\nТы падаешь. Дергаешься в немых конвульсиях.\nЗеркальная маска - над тобой. Математические кошмары пляшут.\nМанипулятор - касается лба. Холод иглы.\n\"Переформатирование. Принятие Истины.\" - голос в пустоте твоего разума.\nПоследняя мысль: \"Я... был... кем?..\"\nПотом - тишина. Идеальная. Послушная.",
    "achievement": "Обращен в ересь"
  },
  "ending10": {
    "title": "Последний Приказ",
    "text": "Ты срываешь с себя рюкзак и швыряешь его к омерзительному кокону реактора.\nЩелчок детонатора.\nСвет. Белый. Слепой. Сжигающий сетчатку.\nТепло. Как объятия Золотого Трона.\nПотом - ничего.\nТы не увидишь, как \"Кровавый Хор\" разрывает волна плазмы. Не услышишь вопли еретиков.\nНо знай.\nТы выполнил последний приказ.",
    "achievement": "Миссия выполнена"
  }
}