{

  "main_menu": {
    "id": "main_menu",
    "text": [
      "===================================",
      "          ПОСЛЕДНИЙ ПРИКАЗ         ",
      "===================================",
      ""
    ],
    "choices": [
      {
        "text": "Начать новую игру",
        "next_target": "scene1"
      },
      {
        "text": "Просмотреть концовки",
        "next_target": "endings_collection"
      },
      {
        "text": "Выход",
        "next_target": "quit_game"
      }
    ]
  },
  "scene1": {
    "id": "scene1",
    "text": [
      "\n\n1",
      "6.208.013.М42. Империум Нигилус. Система «Цинис».\n",
      "Кадия пала.",
      "Её падение развязало клыки Хаоса, и теперь они впиваются в горло беззащитных миров. Цинис-Прайм — мир-улей, чьи шпили ещё дышат пеплом последних молебнов, чьи миллиарды душ ещё шепчут молитвы в темноте. Но их шепот слишком тихий, чтобы заглушить рёв приближающейся бури.",
      "Флот вторжения пришёл.",
      "Им навстречу — последние дышащие корабли Империума."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene2"
      }
    ]
  },
  "scene2": {
    "id": "scene2",
    "text": [
      "\n\n2",
      "Лорд-Адмирал Кассиус Вальтер.\n",
      "Он знал.",
      "Ещё когда астропаты корчились от боли, а варп застыл в неестественном безмолвии, он понял. Это — конец. Его флот — небольшая патрульная эскадра, прибывшая на ремонт. И жалкая горстка разномастных коробок: пяток фрегатов с прогнившими переборками, системные мониторы, чьи орудия захлёбываются от старости, и «крейсер» — на деле торговый ковчег, облепленный пушками, как протезами.",
      "Но отступить? Некуда.",
      "Сдаться? Никогда.",
      "Его план был прост, как удар топора палача:",
      "Задержать. Изранить. Умереть.",
      "Может быть — просто может быть — этого хватит, чтобы кто-то успел спастись."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene3"
      }
    ]
  },
  "scene3": {
    "id": "scene3",
    "text": [
      "\n\n3",
      "«Кровавый Хор».\n",
      "Флагман. Авангард вторжения. Он плыл, словно гнойная язва на лике реальности.",
      "Некогда — гордый крейсер класса «Адское Пламя». Теперь — уродливый собор из плоти и брони, где каждую заклёпку целуют языки демонов. Его башни изогнулись, как кости еретика на дыбе, а по бортам ползали тени, слишком длинные, чтобы быть человеческими.",
      "На мостике, в троне, сплетённом из рёбер и цепей, восседал Вар’Зул Кровавый.",
      "Именно его корабль нужно было убить."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene4"
      }
    ]
  },
  "scene4": {
    "id": "scene4",
    "text": [
      "\n\n4",
      "Сержант Торгус «Железный» Кейн.\n",
      "План прост. - Его голос в вокс-бусине не дрогнул ни на йоту, хотя все знали — это голос мёртвого человека.-Входим. Режем. Взрываем. Бабах.",
      "Кто-то хрипло засмеялся.",
      "После — стоим перед Золотым Троном, а сестрёнки-Сорроритас поют нам дифирамбы. Вопросы?",
      "Вопросов не было.",
      "Их уже убили.",
      "Просто ещё не все упали.",
      "Тогда держимся. - Сержант щёлкнул предохранителем. - Сейчас нас хорошенько тряхнёт.",
      "И тряхнуло."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene5"
      }
    ]
  },
  "scene5": {
    "id": "scene5",
    "text": [
      "\n\n5",
      "Тьма.",
      "Тишина.",
      "Потом — боль.",
      "Она раскалывает череп, выжигает сознание, заставляет тело содрогнуться в судорогах. Ты пытаешься вдохнуть, но вместо воздуха в лёгкие врывается едкий дым — смесь гари, крови и чего-то ещё… сладковатого, гнилого.",
      "Зрение возвращается медленно.",
      "Ты лежишь на потолке.",
      "Нет.",
      "Ты лежишь на полу, но десантный модуль вмят в переборку флагмана еретиков так сильно, что всё перекосилось. Металл скрипит, где-то шипит разорванная гидравлика, а по струнам кабелей стекают густые капли — то ли масло, то ли кровь.",
      "Вокруг — твои люди.",
      "Сержант Кейн, его шлем раздавлен, лицо залито багровой пеной. Молодой рекрут Векс, его тело изуродовано так, словно кто-то протащил его через шипастую воронку. И ещё несколько фигур. Разорванных, переломанных, искаженных.",
      "Из динамиков, залитых статикой, доносится хор шёпотов — молитва на языке, от которого сводит зубы.",
      "И тут — движение."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene6"
      }
    ]
  },
  "scene6": {
    "id": "scene6",
    "text": [
      "\n\n6",
      "Сержант.",
      "Его пальцы дергаются, окровавленная перчатка сжимает твою руку, судорожно тычет в ладонь холодный металл — детонатор. Его губы шевелятся, но вместо слов — только пузыри кровавой пены.",
      "— Д… д…",
      "Его голова откидывается назад.",
      "Ты один.",
      "Ты сжимаешь детонатор в кулаке — холодный, чужой, как сердце еретика.",
      "Бесполезный.",
      "Без взрывчатки — это просто кусок металла, который не спасёт ни Цинис-Прайм, ни тебя.",
      "Рюкзак.",
      "Он лежит рядом, изуродованный, но целый. Ребра каркаса вмяты, ткань прожжена кислотными подтёками, но мельтазаряд внутри — живой. Ты прикидываешь вес — тяжелее, чем должен быть. Как будто сама судьба давит тебе на плечи, напоминая: «Ты несешь смерть. Свою и их».",
      "Ты натягиваешь лямки, и рюкзак впивается в спину.",
      "Оружие.",
      "Лазган — царапины на прикладе, пятна крови на стволе. Батарея — полная. Хватит, чтобы проложить дорогу. Но не чтобы выйти.",
      "Нож — чёрный, словно ночь над Кадией. Ты проводишь пальцем по лезвию, и оно отвечает холодом.",
      "Теперь ты готов.",
      "Как мертвец, идущий на похороны."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "character_creation"
      }
    ]
  },


  "character_creation": {
    "id": "character_creation",
    "text": [
      "Создание персонажа",
      "Распределите характеристики вашего бойца"
    ],
    "auto_action": "start_creation",
    "choices": [
      {
        "text": "Создать персонажа",
        "next_target": "scene7"
      }
    ]

  },


  "scene7": {
    "id": "scene7",
    "text": [
      "\n\n7",
      "Судно содрогается, как зверь в предсмертных судорогах. Где-то далеко грохочут макроорудия — это Имперские корабли бьют по «Кровавому Хору». Или это еретики добивают твоих братьев.",
      "Аварийные лампы мигают, как угасающие звёзды. В их кровавом свете трюм кажется гигантской гробницей.",
      "Дверь.",
      "Она в конце зала. Лифт. Твой путь вверх — к реакторам, к миссии, к концу.",
      "Но между тобой и дверью — тьма.",
      "Стоит ли тратить время, чтобы осмотреть тела? Обыскать трюм в поисках чего-то полезного? Или же двигаться дальше, к лифту?"
    ],
    "choices": [
      {
        "id": "inspect_bodies",
        "text": "Осмотреть тела",
        "condition": "!flags.bodies_inspected",
        "effects": {
          "set_flags": { "bodies_inspected": true }
        },
        "check": {
          "type": "intelligence",
          "difficulty": -2,
          "results": {
            "success": "scene7_1_success",
            "fail": "scene7_1_fail"
          }
        }
      },
      {
        "id": "search_hold",
        "text": "Обыскать трюм",
        "condition": "!flags.supplies_found",
        "effects": {
          "set_flags": { "supplies_found": true }
        },
        "check": {
          "type": "intelligence",
          "difficulty": 0,
          "results": {
            "success": "scene7_2_success",
            "fail": "scene7_2_fail"
          }
        }
      },
      {
        "id": "to_elevator",
        "text": "К лифту",
        "condition": "!flags.mutant_defeated",
        "effects": {
          "set_flags": { "mutant_encountered": true }
        },
        "check": {
          "type": "dexterity",
          "difficulty": -4,
          "results": {
            "success": "scene7_3_success",
            "fail": "scene7_3_fail"
          }
        }
      },
      {
        "id": "continue_to_elevator",
        "text": "Продолжить к лифту",
        "condition": "flags.mutant_defeated",
        "next_target": "scene8"
      },
      {
        "id": "return_to_inspection",
        "text": "Вернуться к осмотру",
        "condition": "flags.mutant_defeated && (!flags.bodies_inspected || !flags.supplies_found)",
        "next_target": "scene7"
      }
    ]
  },
  "scene8": {
    "id": "scene8",
    "text": [
      "\n\n8",
      "Стальные челюсти лифта разжались с хриплым скрежетом, выплюнув тебя в утробу корабля. Воздух здесь был другим – тяжелым, спертым, пропитанным запахом окисленной крови, прогорклого масла и чего-то сладко-тлетворного, что щекотало ноздри даже сквозь фильтры шлема.",
      "Ты делаешь шаг вперед.",
      "Перед тобой зиял не коридор, а искаженный лабиринт. Стены изгибались неестественно, словно в судороге, опорные балки торчали из обшивки, как сломанные кости, оплетенные пульсирующими багровым светом змеями кабелей. Палуба вздыбилась уступами и провалами, заваленная металлоломом и обугленными обломками. С потолка свисали кровавые сталактиты слизи и клубки высохших кишок проводов. Скудный свет аварийных ламп — редкие красные оспины и синие искры — был практически бесполезен.",
      "Имперская логика, четкая как строевой шаг, здесь была растоптана и извращена.",
      "Тишина, нарушаемая лишь мерным гулом машинерии. И шаги. Тяжёлые. Нечеловеческие. Уверенные в своей неоспоримой силе.",
      "Оно здесь.",
      "Страж.",
      "Встреча с ним — только смерть.",
      "Быстрая. Жестокая.",
      "Ты вжался в холодную, липкую стену. Ледяной пот стекал по позвоночнику.",
      "Лабиринт ждал."
    ],
    "choices": [
      {
        "id": "inspect_surroundings",
        "text": "Осмотреться",
        "condition": "!flags.scene8_inspected",
        "effects": {
          "set_flags": { "scene8_inspected": true }
        },
        "check": {
          "type": "intelligence",
          "difficulty": 2,
          "results": {
            "critical_success": "scene8_intelligence_critical",
            "success": "scene8_intelligence_success",
            "fail": "scene8_intelligence_fail"
          }
        }
      },
      {
        "id": "move_dexterityily",
        "text": "Двигаться скрытно",
        "condition": "flags.scene8_inspected",
        "check": {
          "type": "dexterity",
          "difficulty": -1,
          "results": {
            "success": "scene9",
            "fail": "ending3"
          }
        }
      },
      {
        "id": "move_openly",
        "text": "Двигаться открыто",
        "condition": "flags.scene8_inspected",
        "next_target": "ending4"
      },
      {
        "id": "set_trap",
        "text": "Заманить в ловушку",
        "condition": "flags.scene8_perception_critical",
        "next_target": "scene8_trap_option"
      },
      {
        "id": "return_to_choice",
        "text": "Вернуться к выбору",
        "condition": "flags.scene8_inspected",
        "next_target": "scene8"
      }
    ]
  },
  "scene8_trap_option": {
    "id": "scene8_trap_option",
    "text": [
      "Твой взгляд стал холодным, острым скальпелем. Он впивался в детали, вырезая из хаоса закономерность. Не Имперскую. Извращенную. Но закономерность.",
      "Тени на искривленных стенах... не просто тени. Они повторяли ритм пульсации кабелей, словно вены на больном теле. Капли с потолка падали не хаотично - они отмечали путь скрытой трещины в плитах выше. Мусорные завалы... не везде одинаково плотные.",
      "И тогда ты увидел ее.",
      "Колонна. Некогда несущая опора. Теперь - искривленный монолит плоти и металла, оплетенный жилами кабелей, пульсирующих тем же багровым светом. Но у её основания... Трещина. Глубокая. Черная. Вокруг нее - сеть мелких прожилок, расходящихся по полу и стене.",
      "Возможность.",
      "Расчеты мелькнули в сознании молниями. Вес. Давление. Его вес. Неизвестного монстра. Его тяжелая поступь, от которой дрожала палуба... Этого хватит. Больше чем хватит. Если он пройдет здесь, под этой колонной, в момент, когда трещина получит последний толчок... Колонна не упадет просто так. Она рухнет, похоронив под собой все в радиусе пяти метров.",
      "Она не сломается от твоего удара. Не взорвется от гранаты. Но под его массой... Она рухнет.",
      "Используй его силу против него."
    ],
    "choices": [
      {
        "id": "lure_monster",
        "text": "Попытаться заманить",
        "check": {
          "type": "willpower",
          "difficulty": -3,
          "results": {
            "success": "scene9",
            "fail": "ending2"
          }
        }
      },
      {
        "id": "retreat",
        "text": "Отступить",
        "next_target": "scene8"
      }
    ]
  },
  "scene9": {
    "id": "scene9",
    "text": [
      "\n\n9",
      "Лабиринт остался позади. Страж — мертв или обманут. Но передышка оказалась миражом.",
      "Ты вошел в Зал Кабельного Потока.",
      "Картина ада, сплетенного инженерами-еретиками.",
      "Пространство огромного грузового отсека исчезло под кипящим морем кабелей. Они не лежали — жили. Толстые, как древесные стволы, жилы основного энергопотока, оплетенные змеями тонких проводов, покрытых колючей изоляцией. Все пульсировало. Багровым светом Хаоса. Ядовито-зеленым ядом утечек. Синим холодом статики. Кабели извивались, как спруты в агонии, скользили друг по другу с шипящим шелестом, обнажая искрящие «язвы» оголенных проводников. Воздух гудел от напряжения в миллионы вольт, пробивающегося сквозь трещины в изоляции. Пахло прожженной изоляцией, едкой кислотой и сладковатой органикой – будто кабели корнями врастали в плоть корабля.",
      "Путь?",
      "Единственная «тропа» – узкие, шаткие мостки из решетчатого настила, брошенные поверх этого кипящего хаоса. Они вели зигзагами через весь зал к массивным, заклепанным дверям на другом конце – твоей цели. Но мостки были не спасением. Испытанием."
    ],
    "choices": [
      {
        "id": "push_through",
        "text": "Прорваться",
        "check": {
          "type": "endurance",
          "difficulty": -2,
          "results": {
            "critical_success": "scene9_2_critical",
            "success": "scene9_2_success",
            "fail": "scene9_2_fail",
            "critical_fail": "scene9_2_critical_fail"
          }
        }
      },
      {
        "id": "analyze_route",
        "text": "Проанализировать маршрут",
        "check": {
          "type": "intelligence",
          "difficulty": 1,
          "results": {
            "critical_success": "scene9_3_critical",
            "success": "scene9_3_success",
            "fail": "scene9_3_fail",
            "critical_fail": "scene9_3_critical_fail"
          }
        }
      }
    ]
  },
  "scene10": {
    "id": "scene10",
    "text": [
      "\n\n10",
      "Реактор.",
      "Не машина. Чудовище.",
      "Центральная сфера – пульсирующий багровый кокон из бронированных сегментов, покрытых руническими шрамами. Сквозь трещины бьет слепящий, неестественный свет, его цвета просто не могут существовать в Материуме.",
      "Он не освещает – калечит зрение.",
      "Реактор оплетен живыми кабелями: толстыми, как тела удавов, пульсирующими темно-синим и кроваво-красным. Они стягивают его, как хирургические лигатуры, впиваясь в порты, из которых сочится черная маслянистая кровь-мазут. По ним ползут искры запретных кодов.",
      "И хранитель реактора.",
      "Он не стоит. Он парит.",
      "Прикованный к реактору десятками кабелей-щупалец, вплетенных прямо в его тело. Нижняя половина – механический паук из полированной черной стали, с острыми, как бритвы, суставами. Верхняя – изуродованная плоть в рваных останках робы Механикус.",
      "Лицо заменено зеркальной овальной пластиной. На ней – постоянно меняющиеся математические кошмары и символы Хаоса. Ни глаз, ни рта – только холодное отражение твоего искаженного страха.",
      "Руки - четыре манипулятора. Два – хирургически точные, с иглами-скальпелями и инъекторами, сочащимися ядом. Один – тяжелая дрель-молот, вращающаяся с тихим воем. Последний – плазменная горелка, жадно плюющаяся сгустками синей энергии.",
      "Он не атакует. Он наблюдает. Его зеркальная маска повернута к тебе. Манипуляторы совершают микроскопические движения, будто проводя расчеты в воздухе. По кабелям бегут волны энергии. Он знает, что ты здесь. Знает, зачем.",
      "Он – последний страж."
    ],
    "choices": [
      {
        "text": "Начать бой",
        "next_target": "combat_tech_heretic"
      }
    ]
  },
  "scene11": {
    "id": "scene11",
    "text": [
      "\n\n11",
      "Цинис-Прайм. Шпиль Молчаливой Благодарности.\n",
      "Пепел последних молебнов еще висел в воздухе. Миллиарды душ, затаивших дыхание в тесных ульях, шептали. Не молитвы. Шепот неверия.",
      "Над сожженными небесными сводами, где еще вчера полыхали когти Хаоса, разорвалась звезда. Не природная. Смерть корабля.",
      "«Кровавый Хор» распался. Огромный, как континент, гнилой собор из плоти и брони, он вздыбился, как раненая тварь, и разорвался изнутри. Волна чистого плазменного огня смыла следы вторжения. Остатки Хаоса бежали. Без порядка. Без славы. Как псы, гонимые кнутом."
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "scene12"
      }
    ]
  },
  "scene12": {
    "id": "scene12",
    "text": [
      "\n\n12",
      "Лорд-Адмирал Кассиус Вальтер.\n",
      "Его флагман, «Правосудие Кадии», выживал на последних крохах воли экипажа. Мостик – полуразрушен. Экраны – мертвы. Но он видел. Видел вспышку гибели флагмана врага. Видел, как хаоситский флот, лишившись сердца, рассыпался в панике.",
      "- Они... сделали это? – хрипло пробормотал старший штурман.",
      "Вальтер не ответил. Он смотрел в мертвый экран, где минуту назад пылал «Кровавый Хор». Его рука, залитая кровью и маслом, сжалась в кулак.",
      "- Они задержали.-  Голос – как скрежет ржавого металла. - Изранили.",
      "Он закрыл единственный уцелевший глаз. Вспомнил десантный модуль. Жалкую горстку штурмовиков. Последний доклад. Голос мертвеца.",
      "- Умерли.- Вальтер открыл глаз.",
      "Его жертва не была напрасна.",
      "Неизвестного штурмовика, чье имя сгорело вместе с «Кровавым Хором»"
    ],
    "choices": [
      {
        "text": "Дальше",
        "next_target": "ending10"
      }
    ]
  },
  "endings_collection": {
    "id": "endings_collection",
    "text": [
      "Здесь собраны все концовки, которые вам удалось открыть в ходе игры."
    ],
    "effects": {
      "auto_action": "show_endings"
    }
  }
}