{
  "scene7_1_success": {
    "text": "Ты замедляешься. Драгоценные секунды уходят, но ты впитываешь детали, как губка кровь: Тела твоих - они погибли при ударе. Сломанные позы, разорванные ремни, стеклянные глаза за потрескавшимися визорами. Рабы культа - их слишком мало. И они не вооружены. Работали здесь, когда вы прибыли. Ты моргаешь. Что-то не так.",
    "set_flags": { "bodies_inspected": true },
    "next_check": {
      "type": "intelligence",
      "success": "scene7_1_int_success",
      "fail": "scene7_1_int_fail"
    }
  },
  "scene7_1_fail": {
    "text": "Тьма давит. Она не просто отсутствие света - она живая, густая... Ты протягиваешь руку - и тьма кажется осязаемой. Звуки? Только шипение разорванных труб, треск искрящихся проводов - и собственное дыхание, слишком громкое в шлеме. Ты слеп. Ты глух.",
    "next_scene": "scene7"
  },
  "scene7_1_int_success": {
    "text": "Числа не сходятся. Ты быстро считаешь - не хватает трёх. Где Дженкинс? Где Марков? Где капрал? Их тел нет. Но есть следы: вырванные из лазганов батареи, пустые подсумки - ни гранат, ни аптечек. Кровавые полосы на полу - будто кого-то тащили.",
    "set_flags": { "missing_soldiers_noted": true },
    "next_scene": "scene7"
  },
  "scene7_1_int_fail": {
    "text": "Голова пульсирует. Может, это контузия? Ты всматриваешься в трупы, но ничего. Нужно двигаться дальше.",
    "next_scene": "scene7"
  },
  "scene7_2_success": {
    "text": "Твой взгляд цепляется за маркировку: «Департамент Муниторум. Сектор 451-Х.» Имперское снаряжение. Кто-то специально сложил его здесь - словно ждал, когда придут новые хозяева. Ты открываешь ящик, и тень прошлого вываливается наружу: две гранаты - стандартные фраги, смертоносные, пахнут машинным маслом. Медпакет - засохшая кровь на упаковке, но содержимое цело. Больше - ничего полезного. Кто-то уже копался здесь до тебя.",
    "set_flags": { "supplies_found": true },
    "add_items": [ "frag_grenade", "frag_grenade", "medkit" ],
    "next_scene": "scene7"
  },
  "scene7_2_fail": {
    "text": "Ящики. Контейнеры. Коробки. Горы трофеев, награбленных с обугленных миров. Ты роешься в них, но всё сливается - оружие без патронов, пустые канистры с горючим, разорванные мундиры с вырезанными на спине восьмиконечными звёздами. Бесполезный хлам.",
    "next_scene": "scene7"
  },
  "scene7_3_success": {
    "text": "Ты замедляешь шаг. Между контейнерами - движение. Искаженный силуэт. Существо, когда-то бывшее человеком, прижалось к металлу, дрожа от голода. Оно еще не видит тебя.",
    "choices": [
      {
        "text": "Атаковать",
        "next_scene": "combat_mutant"
      },
      {
        "text": "Пройти незамеченным",
        "check": "stealth",
        "success": "scene8",
        "fail": "combat_mutant"
      }
    ]
  },
  "scene7_3_fail": {
    "text": "Ты идешь слишком прямо, слишком уверенно - как будто этот корабль уже твой. Ошибка. Нога цепляет пустую канистру - она с грохотом катится по полу, звенит, как колокол на похоронах. Тишина. На секунду. Потом - рык. Оно голодно...",
    "set_flags": { "mutant_encountered": true },
    "next_scene": "combat_mutant"
  },
  "scene8_critical": {
    "text": "Твой взгляд стал холодным, острым скальпелем. Он впивался в детали, вырезая из хаоса закономерность. Не Имперскую. Извращенную. Но закономерность. Тени на искривленных стенах... не просто тени. Они повторяли ритм пульсации кабелей, словно вены на больном теле. Капли с потолка падали не хаотично - они отмечали путь скрытой трещины в плитах выше. Мусорные завалы... не везде одинаково плотные. И тогда ты увидел ее. Колонна. Некогда несущая опора. Теперь - искривленный монолит плоти и металла, оплетенный жилами кабелей, пульсирующих тем же багровым светом. Но у её основания... Трещина. Глубокая. Черная. Вокруг нее - сеть мелких прожилок, расходящихся по полу и стене. Возможность. Расчеты мелькнули в сознании молниями. Вес. Давление. Его вес. Неизвестного монстра. Его тяжелая поступь, от которой дрожала палуба... Этого хватит. Больше чем хватит. Если он пройдет здесь, под этой колонной, в момент, когда трещина получит последний толчок... Колонна не упадет просто так. Она рухнет, похоронив под собой все в радиусе пяти метров. Она не сломается от твоего удара. Не взорвется от гранаты. Но под его массой... Она рухнет. Используй его силу против него.",
    "choices": [
      {
        "text": "Заманить монстра в ловушку",
        "check": "agility",
        "success": "scene9",
        "fail": "ending2"
      }
    ]
  },
  "scene8_perception_success": {
    "text": "Твой взгляд, закаленный в руинах дюжины миров, скользит по лабиринту, выхватывая детали выживания. Не слабость врага. Пути ускользнуть. Тени. Они лгут. Но их ложь - твой союзник. Ты отмечаешь карманы тьмы - глубокие вмятины в стенах под балками-ребрами, ниши за грудами обугленного лома. Не идеальные укрытия. Но достаточные, чтобы вжаться, сломать силуэт. Запомнил их расположение. Здесь спрячешься. Переведешь дух. Звуки. Эхо пляшет. Но ты улавливаешь ритм. Тяжелый топот Стража. Он не хаотичен. Отсюда... до конца ответвления... пауза... поворот... и обратно. Как маятник часов. Предсказуемо. Поверхность. Палуба под ногами - не монолит. Ты замечаешь островки устойчивости. Участки, где плиты лежат плотно, не скрипят. И ловушки шума - области с рассыпанным мелким щебнем, обрывками хрупкой обшивки. Наступишь - треск разнесется по всему туннелю. Обходи их. Запахи. Сладковатая гниль сильнее у левой стены, где стекают струйки слизи. Озон и гарь - правее, где искрят разорванные кабели. Ориентиры. Держись правой - меньше риск, что фильтры шлема захлебнутся тленом, и ты выдашь себя кашлем. Карта теней. Карта тишины. Карта твердой земли. Это - ключ к победе. Ключ к тому, чтобы не быть замеченным. Пока ты тише тени - у тебя есть шанс пройти.",
    "set_flags": { "scene8_stealth_auto": true },
    "next_scene": "scene9"
  },
  "scene8_perception_fail": {
    "text": "Ты напрягаешь зрение, вглядываясь в изгибы лабиринта. Должны быть щели. Тропы. Приметы. Но окружение давит. Стены будто сдвигаются, углы расплываются в мареве подмигивающих аварийных огней. Контуры теней пульсируют, сливаясь в сплошную, угрожающую черноту, которая не предлагает укрытий, а лишь поглощает надежду. Звуки обрушиваются каскадом. Шипение пара превращается в злобный шёпот. Капли падают с гулким эхом пульсирующей крови в висках. А топот... Он вездесущ. Вычленить ритм? Предугадать? Невозможно. Каждый удар вдавливает тебя глубже в липкий страх. ОНО рядом. Всегда рядом. Ты пытаешься сосредоточиться на полу, искать безопасный путь, но плиты под ногами кажутся зыбкими. Каждый шаг, даже мысленный, грозит громким предательским скрипом, треском, гулом. Вся поверхность выглядит единой ловушкой, готовой громко крикнуть о твоем присутствии при малейшем прикосновении. Ориентиры? Помощь? Ничего не вырисовывается. Только бесформенный кошмар. Удачи.",
    "choices": [
      {
        "text": "Двигаться скрытно",
        "check": "stealth",
        "success": "scene9",
        "fail": "ending3"
      },
      {
        "text": "Атаковать",
        "next_scene": "ending4"
      }
    ]
  }
}