{
  "combat_mutant": {
    "enemy": "Мутант",
    "health": 20,
    "player_turn": {
      "options": [
        {
          "type": "shoot",
          "results": {
            "critical_success": "Выстрел. Идеальный. Луч срезает руку мутанта по самую лопатку. Крови нет - лазер прижигает рану. Но тварь ещё жива. Она шатается, рычит, но глаза её полны ярости, а не страха. Ты искалечил ее. Но не убил.",
            "success": "Выстрел. Чистый. Смертельный. Луч прожигает грудь твари, выжигая дыру размером с кулак. Мутант вздрагивает, его кожа пузырится, внутренности испаряются — и он орёт. Орёт так, будто это последний звук во вселенной. Но он еще жив. И бросается вперед.",
            "fail": "Вспышка! Лазерный луч рвёт тьму, ослепляя на секунду. Грохот! Где-то сзади разлетается контейнер с трофеями, обдавая всё вокруг искрами и дымом. Ты промахнулся. Тварь взвизгивает, но не от боли — от ярости. Ты видишь её глаза — жёлтые, горящие — прежде чем она бросается вперёд.",
            "critical_fail": "Ты вскидываешь лазган, приклад привычно упирается в плечо, палец давит на спуск... ... щелчок. Тихий. Унизительный. Ни вспышки, ни гула разряда. Ты дергаешь скобу снова — снова щелчок. Император отвернулся. А тварь... Тварь замирает, её уродливая морда кривится в пародии на улыбку. Она понимает. Император отвернулся."
          }
        },
        {
          "type": "melee",
          "results": {
            "critical_success": "Ты рубишь. Снова. И снова. Сталь режет мышцы, дробит кость — рука мутанта висит на лоскуте кожи, болтаясь, как сломанная кукла. Кровь бьёт фонтаном. Тварь орёт, шатается, но не падает — её глаза горят ненавистью.",
            "success": "Удар! Нож вонзается в её грудь, разрывая плоть, чёрная кровь хлещет на твою броню. Тварь вопит, её когти рвут воздух, но ты успеваешь отпрыгнуть. Она ранена. Но ещё не убита.",
            "fail": "Ты бросаешься вперёд, нож сверкает... ... но тварь прыгает назад, её кривые зубы обнажаются в гнилой ухмылке. Ты чувствуешь её дыхание — горячее, гнилое — но не можешь достать...",
            "critical_fail": "Ты рвёшь нож из ножен, сталь свистит в воздухе... ... промах. Тварь изгибается, как змея, её пальцы впиваются в твоё запястье. Щелчок. Боль. Нож падает на пол, звенит, отскакивает в темноту. Твое тело предало тебя. Ты лишился клинка."
          }
        },
        {
          "type": "grenade",
          "results": {
            "success": "Ты рвёшь гранату с пояса — холодный металл, знакомый вес в ладони. Чека. Бросок. Ты ныряешь за ближайшее укрытие — и мир взрывается. Огонь. Дым. Куски мяса, разлетающиеся по стенам. Когда дым рассеивается — перед тобой только яма в полу, обугленные останки и звенящая тишина.",
            "fail": "Ты тянешься к гранате... но её нет! Пояс пуст. Мутант рычит, приближаясь."
          }
        },
        {
          "type": "medkit",
          "results": {
            "success": "Ты выхватываешь аптечку, разрываешь упаковку. Шприц — в бедро. Жгучий холод растекается по венам, глушит боль. Ты не здоров. Но ты снова можешь драться.",
            "fail": "Пусто! Аптечка разорвана при ударе или потеряна в темноте. Лечения не будет."
          }
        }
      ]
    },
    "enemy_turn": {
      "results": {
        "critical_success": "Тварь не просто атакует — она шокирующе быстра. Её удар — молниеносный выпад — выбивает оружие из твоих рук. Твой лазган падает, скользит по полу, исчезает во тьме. А её второй удар — когти в твою грудь — оставляет кровавые полосы. Ты отлетаешь назад, влетая спиной в металлический контейнер.",
        "success": "Удар! Её когти — длинные, как ножи — впиваются в твою броню, рвут плоть. Боль. Горячая. Яркая. Кровь течёт по рёбрам, но ты стискиваешь зубы.",
        "fail": "Тварь рвётся вперёд, её когти — как бритвы — проносятся в сантиметре от твоего горла. Ты чувствуешь ветер от удара. Запах гнили из её пасти. Она почти достала тебя. Но почти — не считается.",
        "critical_fail": "Тварь бросается — ты отшатываешься. Она пролетает мимо, врезается в контейнер. Хруст. Вой. Её рука теперь торчит под неестественным углом, кость пробила кожу."
      }
    },
    "on_win": {
      "set_flags": { "mutant_defeated": true },
      "next_scene": "scene7"
    },
    "on_lose": "ending1"
  },
  "combat_tech_heretic": {
    "enemy": "Техноеретик (Паук)",
    "health": 50,
    "player_turn": {
      "options": [
        {
          "type": "shoot",
          "results": {
            "critical_success": "Твой выстрел направил сам Император! Лазерный луч пробивает щит кабелей и бьет прямо в зеркальную маску. Треск! Пластина осыпается. Под ней — пульсирующая черная жижа вместо лица. Паук воет. Не звук, который может издать живое существо. Визг тормозящих поездов. Кабели судорожно дергаются.",
            "success": "Выстрел пробивает омерзительное тело техноеретика. Техномант отшатывается. Зеркальная маска мерцает яростью. Хороший выстрел. Но не смертельный.",
            "fail": "Луч отражается от маски. Рикошетит в потолок. Ослепительный фонтан искр! Паук не дрогнул. Его руки уже нацелены на тебя.",
            "critical_fail": "Заряд захлебывается. Лазган взрывается в руках! Осколки — в лицо. Ожоги — на руках. Ты безоружен. Кабели тянутся к тебе."
          }
        },
        {
          "type": "melee",
          "results": {
            "critical_success": "Ты нырнул под плазменный сгусток. Вонзил клинок в стык плоти и стали на \"шее\". Шипение кислоты! Черная жижа хлещет. Паук скрежещет. Его манипуляторы бьются в конвульсиях. Слабость найдена!",
            "success": "Уклонился от скальпеля-иглы. Удар по руке! Клинок цепляет пучок проводов. Искры! Малый урон. Но он отступил. Кабели вздыбились угрожающе.",
            "fail": "Не рассчитал. Кабель-щупальце опутал руку. Тянет! Панический рывок. Вырвался. Нож чуть было не упал в кипящую масляную лужу, но ты удержал свое оружие.",
            "critical_fail": "Дрель-молот встретил твой рывок. Прямо в грудь. Хруст брони. Хруст ребер. Ты отброшен. Кровь хлещет из-под разорванной брони."
          }
        },
        {
          "type": "grenade",
          "results": {
            "success": "Бросок! Граната — отправляется прямо под ноги техноеретика. ВЗРЫВ! Огонь пожирает кабели. Паук ревет. Его механизмы оголены! Реактор завыл громче.",
            "fail": "Слишком поздно! Манипулятор плазменной горелки перехватывает гранату в воздухе. Взрыв происходит далеко от цели!"
          }
        },
        {
          "type": "melta_charge",
          "results": {
            "success": "Ты срываешь с себя рюкзак и швыряешь его к омерзительному кокону реактора. Щелчок детонатора. Свет. Белый. Слепой. Сжигающий сетчатку. Тепло. Как объятия Золотого Трона. Потом — ничего.",
            "fail": "Кабели-щупальца хватают рюкзак в полёте! Они отбрасывают смертоносный груз в сторону. Заряд не достиг цели!"
          }
        }
      ]
    },
    "enemy_turn": {
      "results": {
        "critical_success": "Зеркальная маска вспыхивает формулой. Сгусток плазмы прожигает пространство. Попадание! Твоя броня плавится. Ребра трещат. Плоть испаряется.",
        "success": "Плазменный шар свистит в сантиметрах. Волна жара. Броня раскалена докрасна. Кожа обожжена. Фильтры шипят. Боль.",
        "fail": "Выстрел бьет в кабель. Фонтан искр! Паук скрежещет. Кабели дергаются. Реактор гудит. Открыт для контратаки!",
        "critical_fail": "Пушка захлебывается. Обратная вспышка! Манипулятор взрывается. Осколки впиваются в его плоть. Его орудие выведено из строя, и он получил урон. Он в ярости!"
      }
    },
    "on_win": "ending10",
    "on_lose": "ending7"
  }
}